Revit 2016 API
LoadCombination.Factor Property
Returns factor value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetComponents() method instead.")]
public double this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetComponents() method instead.")> _
Public ReadOnly Property Factor ( _
	index As Integer _
) As Double
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetComponents() method instead.")]
public:
property double Factor[int index] {
	double get (int index);
}
Parameters
index
Type: System.Int32
The index of factor in load combination.
Remarks
The index should be not less 0 and be less than load factors count.
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace